#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d75839ea-72d7-4ec0-8073-06a04f193db1]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ad61cc5e-3543-4c9c-b055-85881880867f]
module.keycloak_test.module.onestopauth_basic.module.client_march-1-b-ce-id-non-prod-teams-5911.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8e654a9d-97bf-49a5-98b7-631cff0ea2a0]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=7db8c7bb-15c6-4b36-9448-8751e7cb21ae]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7ca2863d-f6b5-4c20-8661-1f18684c4144]
module.keycloak_test.module.onestopauth_basic.module.client_march-1-b-ce-id-non-prod-teams-5911.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4765c7d9-7794-47ac-b10a-dd2eab7cdb30]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4aa3e003-ecf2-4e87-98dd-f180febef935]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9032a9a0-1dba-471d-80e9-bfee5b92c65f]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=98597753-03f7-4918-9786-89ea80b519da]
module.keycloak_test.module.onestopauth_basic.module.client_march-1-b-ce-id-non-prod-teams-5911.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=74868559-5119-47aa-b1e2-7319314fa979]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=16f5bb92-e699-4030-8a5a-284cf5754e3f]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c4ea7d68-8ebe-41c7-a535-d7c7ece8c82b]
module.keycloak_test.module.onestopauth_basic.module.client_march-1-b-ce-id-non-prod-teams-5911.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=6eb675ce-58a6-4683-a92f-f72f8cdbe216]
module.keycloak_test.module.onestopauth_basic.module.client_march-1-b-ce-id-non-prod-teams-5911.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f6909b4e-0ce3-4d6e-b341-ff46c2eea6ce]
module.keycloak_test.module.onestopauth_basic.module.client_march-1-b-ce-id-non-prod-teams-5911.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=602b5b4c-d346-448f-b0a6-feac9aa5e66f]
module.keycloak_test.module.onestopauth_basic.module.client_march-1-b-ce-id-non-prod-teams-5911.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a6ec9807-f94d-464c-9995-7626642e2e29]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ec12df76-4a72-4dcb-ba5f-f880f9fb67c7]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=1ce9bb04-3df4-48e5-8eda-aacb1d6ddd91]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6a37ff63-738e-4914-9067-f1b201cd6c85]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=1265110f-8849-4ddb-b384-b22e2770c401]
module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1c6ac12d-0307-46ee-91ef-24c7140dbb7b]
module.keycloak_test.module.onestopauth_basic.module.client_mar-1-test-1-b-ce-id-5941.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=95684b10-b219-4bdf-8a4f-aee42ae29865]
module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d516214a-1ace-427f-9a5a-b2c3bc91d956]
module.keycloak_test.module.onestopauth_basic.module.client_mar-1-test-1-b-ce-id-5941.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d1eb4741-d29e-4132-885f-cf30d66d07bd]
module.keycloak_test.module.onestopauth_basic.module.client_mar-1-test-1-b-ce-id-5941.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6c1f4ff7-298d-4426-b471-39afd9198ada]
module.keycloak_test.module.onestopauth_basic.module.client_mar-1-test-1-b-ce-id-5941.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1d1e0f32-4475-438e-8a69-8a23cfd553bd]
module.keycloak_test.module.onestopauth_basic.module.client_mar-1-test-1-b-ce-id-5941.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=60fc4aaf-f45a-47f7-a9e3-a37987afcb2f]
module.keycloak_test.module.onestopauth_basic.module.client_mar-1-test-1-b-ce-id-5941.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6bb4e355-fbc2-42e8-8e45-27240c695053]
module.keycloak_test.module.onestopauth_basic.module.client_mar-1-test-1-b-ce-id-5941.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=723ac31f-48ab-4124-9673-7d305bc091a8]
module.keycloak_test.module.onestopauth_basic.module.client_mar-1-test-1-b-ce-id-5941.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f2ad9360-3124-4952-ad1a-d885411bd523]
module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ebe51cd9-bb96-425a-8de9-a788d57b29cb]
module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0638501f-d89b-4b15-8aa8-3e6cd5a91724]
module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=cc93e477-26b6-4b09-8728-75785a46c0ab]
module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=63c0c505-6a3e-4697-812f-d7ab2e1975e8]
module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=38801722-3ad5-4115-ac40-81c724a0f786]
module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bc6e5c02-6cf2-4410-a3b8-564746166b3d]
module.keycloak_test.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=5d4b9e58-52a7-4d27-9e2c-67e74e4f4c89]
module.keycloak_test.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1c379eff-166d-47af-b4a8-336775f39c65]
module.keycloak_test.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6435638c-5046-4b70-8a06-2e6c19fc9976]
module.keycloak_test.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0f62714a-5354-4b61-bb11-add0e9a44b81]
module.keycloak_test.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=8425a818-1650-4368-81a7-252ff265865f]
module.keycloak_test.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f0003644-40d8-4c66-964b-44a467a515f7]
module.keycloak_test.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=62d76ddf-f5e3-4d82-be12-d31ef78a5a08]
module.keycloak_test.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2c56ada8-5485-4f24-bc80-e85e88c00fa1]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=27ef1561-68ed-4e26-8ef4-dac5d728820b]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0ca9e56d-c5e3-43e9-94e3-805faa432ce4]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=1076fe8f-5061-4831-9f25-fea801d81bf0]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=181b8c8d-8493-4d24-a934-325134dce5fe]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=cbb2e91b-a778-4009-8bac-dfaa9167a26e]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f7d8d4f4-8b87-4bec-b93a-dde43933fddb]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4469be6d-8923-45fd-b11b-a8d12348adac]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=100dfeb7-32a5-417e-a708-3b0930945a72]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d4c6e68f-1a15-4f2e-a79d-be8d3bed6eac]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=df7401fe-fa01-48c5-a175-231f43b8158a]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f56c02fc-40b5-4b7e-9a8a-e3154eec75a1]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=c63c5f6f-4350-4886-8d39-a14df306392f]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9a0a937e-9d25-46df-87e2-d068f958ee7a]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=361cf6c5-94db-4aa1-9a12-f0ad60588a27]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=19712263-5b2a-438f-8724-2191b1a1fcd9]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=12977c21-4d9f-4354-b30b-27170906e250]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=166a0a9b-7bed-4076-b9b0-9e6d8763d890]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=79da43e5-49c8-47e1-97a6-77b95d261005]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7ac3656b-5da0-447d-9519-440afd8687af]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=25dfc71f-2263-428b-8516-909100cc565e]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3a7ce87c-4b11-4ebb-a19d-2a24cb3e1ee6]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=fe82c085-65b5-4720-832f-2c75a1cff0b3]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b1c643ed-e3ef-4d86-83f6-58262266e7a9]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4193c24e-5ad0-450b-b023-1b9eedbb2f2d]
module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=546be6f9-e99b-4240-ba29-e348d1b9ada0]
module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=143f6b0f-5dea-4614-9d71-eae35f82560c]
module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ed8d8696-11ff-49fc-a941-d7ff5c9d7a14]
module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8f854209-7836-41ac-9437-abada1f8f71c]
module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=cf52ea3f-01a8-47f6-b569-3bc721e1a871]
module.keycloak_test.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=33a4aac9-3342-4632-bd1a-36bcc8637b5a]
module.keycloak_test.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=75933f18-bca5-46cb-944b-1a17f6dc673f]
module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=eb9cdc43-c707-43aa-b875-1487bade2e8e]
module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1e88ab2c-70c0-4d4a-92f7-e65edaa3da92]
module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4ecef68e-ca70-420a-ad5b-c47bd4eb451c]
module.keycloak_test.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b3fa1552-d8ff-4e32-8bc4-d73d66b5e5f2]
module.keycloak_test.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9ebc1b36-0da2-452b-b876-e4b1e4a048fe]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=faf23fbd-e2c7-4bcf-84e2-1be6a29ebd8c]
module.keycloak_test.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=567274d1-7d7e-4293-bf0e-50649b4d565c]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=4969436c-370e-40e5-95e6-274a87fe85a6]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=7f4ae80c-53c3-4347-b191-6d1ffba9c519]
module.keycloak_test.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=813f7f60-e49e-4bf2-afab-06e80230307c]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7772118c-8444-44c9-9c7f-511037d800f6]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ddf41877-1ec3-4f3a-9dc8-6c3bb355f53b]
module.keycloak_test.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=becdc53d-0e9c-4b7c-b97c-09dd8c183ae2]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d5be50a8-a0a3-4f47-9e47-95db04b2d6bf]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e0776b81-e6a5-4946-9274-60a1f7a37b38]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0cd7fc4a-e210-43bd-a610-ee655f762b5d]
module.keycloak_test.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7205a5d1-c58c-454a-880c-00d8952d9571]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1766753c-5bec-4425-b67b-99096816e02e]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c12bf377-f60c-4b79-b1ef-5828f1ab66f9]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=919a2516-5484-44bf-ba5d-298b70c76a83]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c29c273e-4919-4ee1-a9c7-e94028642638]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=af79bb43-7e01-4a26-9813-bd8eccce45ec]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2ad14a42-adf0-4eb6-b87f-04478a1b85ba]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=771cf276-c9b5-42d8-ad89-11674cbabf0e]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8e38de05-06d5-436a-9de0-b320970d2c38]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "08e8bf95-14c9-4e19-8180-0b47a729a08d"
        name                                     = "march-2-b-ce-id-non-prod-to-prod-6043"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }
  # module.keycloak_test.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "2d2bcae6-8fdd-4ca7-860c-cebb5d4913aa"
        name                                     = "march-2-b-ce-id-non-prod-to-prod-6043"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "march-2-b-ce-id-all-prod-6044"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "march-2-b-ce-id-all-prod-6044"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "march-2-b-ce-id-all-prod-6044"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "march-2-b-ce-id-all-prod-6044"
      + realm_id                                 = "onestopauth-business"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https:///www.test.ca/devChange",
        ]
    }

  # module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "march-2-b-ce-id-all-prod-6044"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "march-2-b-ce-id-all-prod-6044"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "march-2-b-ce-id-all-prod-6044"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "march-2-b-ce-id-all-prod-6044"
      + realm_id                                 = "onestopauth-business"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://www.test.ca/testCHANGED",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3627 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*